{
    "meta": {
        "tags": ["eCommerce", "SaaS", "Responsive design", "Apps"],
        "role": ["Wireframing", "Prototyping", "UI", "UX", "Style Guide"],
        "videoPath": [""]
    },
    "intro": {
        "project": "Webstore Editor",
        "title": "Empowering retailers to customize their <span class=\"no-wrap\">e-commerce</span> website",
        "subtitle": "Losing high-performing shops to competitors",
        "section": "context",
        "text": ["All retailers using CommentSold are provided with an <span class=\"no-wrap\">e-commerce</span> website and native app as part of their plan.", "We were starting to lose some of our best-performing shops to competitors because our webstore and editing tools were below par.", "Along with this, hundreds of new shops were being onboarded each month and already were behind the competition."]
    },
    "process": {
        "section": "process",
        "sectionTitle": "A Lean UX approach",
        "text": ["The team knew that our solution had to improve for both retailers and their end customers. We needed to release a meaningful iteration to win back shops that left and give new shops the best chance at launch success.", "A <a href=\"https://www.interaction-design.org/literature/article/a-simple-introduction-to-lean-ux\" target=\"_blank\" class=\"folio-link no-wrap\">Lean UX</a> approach to the project was taken; the teams weren't working to 'requirements' and 'deliverables' but collaborated around a core problem statement and a set of assumptions.", "I created some Lean UX artifacts to help the cross-functional teams rally around guiding references over the course of the project."],
        "diagramMVP": "https://folio22.s3.amazonaws.com/webstore/mvp-pyramid.png",
        "diagramMVPalt": "Diagram of MVP pyramid",
        "diagramMVPcaption": "The Minimum Viable Product (MVP) had to satisfy many levels of user needs",
        "diagramMVPFigmaLink": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D78%253A8031",
        "diagramLeanUX": "https://folio22.s3.amazonaws.com/webstore/lean-ux-canvas.png",
        "diagramLeanUXalt": "Diagram of Lean UX canvas",
        "diagramLeanUXcaption": "The Lean UX canvas is very helpful for a cross-functional team to focus on the 'why' of the project",
        "diagramLeanUXFigmaLink": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D77%253A7284"
    },
    "research": {
        "section": "research",
        "sectionTitle": "Addressing key pain points",
        "text": ["We had a wealth of feedback from retailers around core pain points; new shopper acquisition being of primary concern. ", "I reviewed the solutions of competitors and compared with our offering at the time. Features were added as requests were received and a holistic review was really needed."],
        "webstoreClassic": "https://folio22.s3.amazonaws.com/webstore/classic-webstore-home.jpg",
        "webstoreClassicAlt": "Example of existing webstore design",
        "webstoreClassicCaption": "The existing webstore design was not a competitive offering for our retailers",
        "heuristic": "https://folio22.s3.amazonaws.com/webstore/heuristics-admin2.png",
        "heuristicAlt": "UI example of heuristics analysis",
        "heuristicCaption": "Heuristics analysis of existing webstore editor",
        "heuristicFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D13%253A17803"
    },
    "ideation": {
        "section": "ideation",
        "sectionTitle": "Consolidate my understanding, explore viewpoints", 
        "textHMW": ["Before getting in to solutions, crafting a ‘HMW…’ question helps me think about the problem space. It’s easy to drift off course and not fully action the right insights or problems.", "The ‘HMW… ?’ is broad enough to allow for sufficient exploration of ideas at the early stage of the project. Typically, I initiate this process and invite contribution from the team so it guides the ideas that follow."],
        "hmw": "...empower newly onboarded and existing retailers to easily and regularly customize their Webstore so as to fully leverage it as a marketing and selling tool ?", 
        "titleCardSort": "Card sort title",
        "textCardSort": ["At this stage of the project I had an abundance of references - feature requests from Shops, existing features on the admin, JSON config files, and notes from interviews with Shop owners.", "There were many suggestions from within the team of additional features we could add. I needed a simple overview of what’s already built, what we’re keeping for v2, and what’s going to be new.", "A simple sticky on a (virtual) whiteboard served the purpose of a quick and easy overview."],      
        "cardSort": "https://folio22.s3.amazonaws.com/webstore/card-sorting-features-cropped.png",
        "cardSortAlt": "Card sorting of features",
        "cardSortCaption": "Card sorting of features for 'classic' and new webstore editor",
        "cardSortFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FH4y0XL1ji8HemtpXL6E58m%2Ffolio22-Webstore-Editor-card-sorting%3Fnode-id%3D31%253A440"
        }, 
    "wireframing": {
        "section": "wireframing",
        "sectionTitle": "'Laddering' the resolutions of the wireframes'",
        "text": ["A significant part of the problem I had to consider was Shopify’s dominance in the small retailer e-comm space. Many of our top retailers wanted to drop Shopify and just use CommentSold, if we leveled-up our webstore", "It was important for me to review competitor solutions for editing tools and try achieve a significant step forward within our resource constraints."],
        "titlePixelUnion": "External agency contribution",
        "textPixelUnion": ["My task was to lead Product Design for the editing tools of the new Webstore on the CommentSold platform.", "<a href=\"https://pixelunion.net/\" target=\"_blank\" class=\"folio-link no-wrap\">PixelUnion</a>, an agency that specializes in Shopify templates, was hired to build out the core e-commerce storefront - landing pages, product search, product detail pages. PixelUnion did make some suggestions for the editor that would be a simple extension of existing tools.", "I saw opportunity for a better user experience and pushed to explore alternatives."], 
        "wirePixelUnion": "https://folio22.s3.amazonaws.com/webstore/pxu-admin2.jpg",
        "wirePixelUnionAlt": "Pixel Union wireframe of editor",
        "wirePixelUnionCaption": "Pixel Union suggestions for the webstore editor",
        "titleWireframes": "Real-time editor concept",
        "textWireframes": ["From early wireframes I was drawn to the idea of users immediately seeing the ‘results’ of editing.", "I presented some early mock-ups to the CTO, VP Engineering and Product Manager; all of them saw the idea as viable and worth pursuing.", "I also initially drafted wireframes as mobile-first, since checkout from the iOS and Android apps was the core funnel.", "Although the end-result was not mobile-first, the new editor and webstore templates were fully responsive."],
        "wireAllTools": "https://folio22.s3.amazonaws.com/webstore/wires-editor-all-tools.png",
        "wireAllToolsAlt": "Webstore editor early wireframe",
        "wiresCaption": "Early wireframes for a 'what-you-see-is-what-you-get' editor",
        "wiresFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D11%253A24669",
        "titleAppFlow": "Supporting multiple versions",
        "textAppFlow": ["Along with designing the new editor, I had to consider how we could enable shops to switch between both the new and existing solution, which I labelled 'classic'.", "Some of our shops had already invested in customizing our webstore to suit their bespoke needs. We could not discard these important business assets, but enable them to transition to the new on their own timeline."],
        "whiteboard": "https://folio22.s3.amazonaws.com/webstore/whiteboard-merge-classic-new.png",
        "whiteboardAlt": "Whiteboard alt",
        "whiteboardCaption": "Initial whiteboard sketch of switching between versions"
        },
    "designs": {
        "section": "designs",
        "sectionTitle": "Increasing the resolution",
        "text": ["I continued to increase the resolution from low-res wireframes to high-res polished designs.", "There was daily collaboration with Product, Engineering, and QA in shaping the design to the point where the team was fully confident in what the next major release was going be.", "Scope, features, ideas all shifted and changed throughout this stage, but having that visual expression was crucial in all decision making."],
        "design": "https://folio22.s3.amazonaws.com/webstore/design-all-tools.jpg",
        "designAlt": "UI design showing all editor tools",
        "designCaption": "Editor tools menu and real-time webstore previewer",
        "designsFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D4%253A3203",
        "toolsTitle": "Multiple and varied tools",
        "toolsText": ["Most of my time was used in designing task flows for the many editor tools. Each tool had its own interaction, but all tools had to have a strong consistency in styling and interaction."],
        "tools": "https://folio22.s3.amazonaws.com/webstore/components-tools.png",
        "toolsAlt": "Selection of tools designed for the editor",
        "toolsCaption": "Tools include site navigation builder, branding, and uploading marketing and promotional assets",
        "toolsFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D13%253A10246",
        "designsPxUTitle": "Webstore design templates",
        "designsPxUText": ["Regular co-ordination with PixelUnion was crucial as the templates they were building had to be customizable as per my designs for each tool. There were many end-points from the core SaaS product API that had to also be captured on the webstore front-end."],
        "designsPxU": "https://folio22.s3.amazonaws.com/webstore/pxu-designs.png",
        "designsPxUAlt": "PixelUnion webstore designs",
        "designsPxUCaption": "The front-end templates were the 'tip of the iceberg' for the underlying SaaS product and editor"
    },
    "delivery": {
        "section": "delivery",
        "sectionTitle": "Collaborating with engineers and QA",
        "text": ["There was a lot of shifting and changing scope on this project.", "The CommentSold platform is feature rich and there are a lot of nuanced considerations - like First-Person-First-Served (FPFS) and comment-harvesting from Facebook - all had some influence on the Webstore and editing tools.", "A lot of communication had to take place between internal and external teams to ensure the tooling and templates and edge-cases were all syncronized.", "My admin editor designs were also crucial in guiding PixelUnion on developing components to be customizable."],
        "appFlowTitle": "Supporting 'classic' and new",
        "appFlowText": ["When designs were at a stage, I created an application flow, screen flow, and clickable prototype to help engineers build for version support of 'classic' and new webstore front-end and editors."],
        "appFlow": "https://folio22.s3.amazonaws.com/webstore/app-flow-classic-to-new.png",
        "appFlowAlt": "Application flow for 'classic' and new",
        "appFlowCaption": "Application flow to allow shops switch between 'classic' and new",
        "appFlowFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FxhDF7sor1ix8AEaa0eVDH5%2Ffolio22-Classic-to-New-Webstore%3Fnode-id%3D1%253A946",
        "walkthrough": "https://folio22.s3.amazonaws.com/webstore/walkthrough-classic-new-revert.mp4",
        "walkthroughCaption": "Walkthrough of activating new webstore editor, publishing changes, then reverting to 'classic'",
        "screenflowFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D28%253A7993"
    },
    "validation": {
        "section": "validation",
        "sectionTitle": "Staged release",
        "text": ["A selection of shops of different revenue cohorts were enlisted for beta testing the new editor tools and front-end webstore. The team allowed a window of testing by shops but not at the risk of competitor shops perceiving and unfair advantage. Once the new version seemed stable, we opened up for general release.", "In the following months we continued to get feedback, mostly positive, from shops on dedicated Facebook groups and encouraged them to raise tickets for any bugs detected."],
        "facebookPost": "https://folio22.s3.amazonaws.com/webstore/facebook-groups-buzz.jpg",
        "facebookPostAlt": "Feedback on a dedicated Facebook group",
        "facebookPostCaption": "Some shop feedback via a dedicated Facebook group"
    },
    "outcomes": {
        "section": "outcomes",
        "sectionTitle": "Improvement across all KPIs",
        "text": ["Within 60 days of general release, all of the key metrics were showing the new version to be successful.", "Some YOY metrics were skewed due to COVID, but still gave us confidence that the new version would continue to out-perform the 'classic'.", "Quantitative and qualitative feedback was very positive across all shop cohorts and new shops were automatically onboarded with the new webstore."]
    },
    "retrospective": {
        "section": "retrospective",
        "sectionTitle": "What could I have done better ?",
        "text": ["There was a lot of scope changing on this project and I could have done more to prevent this. Because the WYSIWYG solution seemed so obvious to me, I jumped in to wireframing a bit too early.", "I had to back-track with some more fundamental UX artifacts, like card-sorting, to help the team re-focus and get consensus on what to build for this iteration, and what will follow afterwards."]
    },
    "snippets": {
        "1": ["Existing and new APIs had to capture all relevant logic and data of live-selling and product life-cycle and be accurately rendered in these templates.", "We quickly realized that including the checkout flow in this iteration would increase scope too much."],
        "2": ["Many of our top retailers were already using Webstore v1 and had hired external agencies to customize our core template to meet their marketing needs.", "We had consulted with a lot of these shops before beginning the project. It was crucial to enable shops to switch between v1 and v2 as they see fit.", "This had many implications on the different features and UI for both the editor and Webstore. I had to problem-solve using diagrams so the team could clearly understand how shops could fulfill this need.", "I created an application flow diagram showing how shops can toggle between v1 and v2.", "Along with the flow diagram I created screenflow options and recorded walkthroughs of prototypes so we could fine-tune a solution."],
        "3": ["I collaborated on this project from end-to-end; the initial scoping and framing of the problem space to the QA testing and release plan.", "We tested with a small selection of shops from different cohorts - newly onboarded to top sellers by volume.", "As all our shops were aware and awaiting the release, we couldn’t be seen to be giving competitive advantage to the selected few.", "I put together a basic framework for releasing this project and future projects also."]
    }
}